Revit 2024 API
BuiltInFailures.CreationFailures.CannotCreateSlantedWallWithSingularLayers Property
 Cannot create wall - its layers would degenerate or intersect. Reduce the wall's height or slant.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateSlantedWallWithSingularLayers { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateSlantedWallWithSingularLayers As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateSlantedWallWithSingularLayers {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace